app/views/watchlists/_status.html.erb

<% else %>
  <% watchlist = current_user.watchlists.find_by(tv_show_id: tv.id) %>
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 AND "watchlists"."tv_show_id" = 4 LIMIT 1  [["user_id", 1]]