app/views/tv_shows/_form.html.erb

             value="10"
             <%= 'checked' if @tv.genre_names.include?("Scripted") %>>
---
SELECT "genres"."name" FROM "genres" INNER JOIN "tv_genres" ON "genres"."id" = "tv_genres"."genre_id" WHERE "tv_genres"."tv_show_id" = $1  [["tv_show_id", 5]]