app/views/tv_shows/show.html.erb

        <strong>Genre(s):</strong>
        <%= @tv.genre_names.join(", ") %>
---
SELECT "genres"."name" FROM "genres" INNER JOIN "tv_genres" ON "genres"."id" = "tv_genres"."genre_id" WHERE "tv_genres"."tv_show_id" = $1 ORDER BY "genres"."name" ASC  [["tv_show_id", 6]]