app/views/searches/_result.html.erb

SELECT "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."status" = 'Currently Airing'
---
		<ul class="watchlist-statuses">
			<% TvShow::STATUSES.each do |status| %>