app/controllers/favorites_controller.rb

  def create
    @favorite = Favorite.new(tv_show_id: params[:tv_id])
    @favorite.user = current_user

    @favorite.save!
---
INSERT INTO "favorites" ("created_at", "tv_show_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 25 Jun 2014 19:43:02 UTC +00:00], ["tv_show_id", 6], ["updated_at", Wed, 25 Jun 2014 19:43:02 UTC +00:00], ["user_id", 1]]

  def destroy
    @favorite = current_user.favorites.find_by(tv_show_id: params[:tv_id])
    @favorite.destroy!
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."tv_show_id" = 6 LIMIT 1  [["user_id", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]