app/controllers/searches_controller.rb

  def new
    @decades = Decade.all
    @genres = Genre.all.order(:name)
---
SELECT "decades".* FROM "decades"
SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC