app/controllers/tv_shows_controller.rb

SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC
---
  def new
    @tv = TvShow.new
    @genres = Genre.all.order(:name)