app/controllers/tv_shows_controller.rb

INSERT INTO "tv_decades" ("created_at", "decade_id", "tv_show_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 25 Jun 2014 20:40:58 UTC +00:00], ["decade_id", 1], ["tv_show_id", 7], ["updated_at", Wed, 25 Jun 2014 20:40:58 UTC +00:00]]
INSERT INTO "tv_genres" ("created_at", "genre_id", "tv_show_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 24 Jun 2014 18:27:19 UTC +00:00], ["genre_id", 3], ["tv_show_id", 1], ["updated_at", Tue, 24 Jun 2014 18:27:19 UTC +00:00]]
INSERT INTO "tv_shows" ("blurb", "created_at", "network", "photo", "rating", "seasons", "status", "title", "updated_at", "year_end", "year_start") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @tv = TvShow.new(tv_params)
    @tv.admin = current_user
    @tv.genre_ids = params[:genre_ids]
    @tv.apply_imdb_rating
    @tv.assign_decade

    if @tv.save

SELECT "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @tv = TvShow.find(params[:id])

SELECT "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."id" = $1 LIMIT 1  [["id", "5"]]
SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC
---
  def edit
    @tv = TvShow.find(params[:id])
    @genres = Genre.all.order(:name)

SELECT "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."id" = $1 LIMIT 1  [["id", "6"]]
UPDATE "tv_shows" SET "photo" = $1, "updated_at" = $2 WHERE "tv_shows"."id" = 6  [["photo", "http://upload.wikimedia.org/wikipedia/en/0/07/Archer_2010_Intertitle.png"], ["updated_at", Wed, 25 Jun 2014 13:30:01 UTC +00:00]]
---
  def update
    @tv = TvShow.find(params[:id])
    @tv.genre_ids = params[:genre_ids]

    if @tv.update_attributes(tv_params)

SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC
---
  def auto_complete_form
    @tv = TvShow.new(title: params[:tv][:title])
    @tv.auto_complete

    @genres = Genre.all.order(:name)