app/controllers/watchlists_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 AND "watchlists"."status" = 'Currently Watching'  [["user_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @watchlist = @user.watchlist_shows.where(watchlists: {
      status: "Currently Watching"
    })

SELECT "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."id" = $1 LIMIT 1  [["id", "4"]]
INSERT INTO "watchlists" ("created_at", "status", "tv_show_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 25 Jun 2014 17:40:35 UTC +00:00], ["status", "Currently Watching"], ["tv_show_id", 4], ["updated_at", Wed, 25 Jun 2014 17:40:35 UTC +00:00], ["user_id", 1]]
---
  def create
    @tv = TvShow.find(params[:tv_id])
    @watchlist = current_user.watchlists.new(watchlist_params)
    @watchlist.tv_show = @tv

    if @watchlist.save

SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "watchlists" SET "status" = $1, "updated_at" = $2 WHERE "watchlists"."id" = 1  [["status", "Plan to Watch"], ["updated_at", Wed, 25 Jun 2014 18:37:55 UTC +00:00]]
---
  def update
    @watchlist = Watchlist.find(params[:id])

    unless @watchlist.update_attributes(watchlist_params)